artillery.yaml
config:
  target: 'http://localhost:8080'  # Change this to your server URL
  phases:
    - duration: 60          # Duration of the test in seconds
      arrivalRate: 1000     # Number of requests per second
  http:
    timeout: 10
scenarios:
  - flow:
    - post:
        url: '/evaluate'
        json:
          expression: '(1000 * 2000) + (3000 / (4000 - (5000 + 6000))) * (7000 - (8000 / 9000)) + (10000 * (11000 - 12000))'
    - post:
        url: '/evaluate'
        json:
          expression: '(1 + (2 * (3 - (4 / (5 + (6 * (7 - (8 + (9 * (10 / (11 + (12 - (13 * (14 + (15 / (16 * 17))))))))))))))))'
    - post:
        url: '/evaluate'
        json:
          expression: '(1 + (2 * (3 - (4 / (5 + (6 * (7 - (8 + (9 * (10 / (11 + (12 - (13 * (14 + (15 / (16 * 17))))))))))))))'